/*******************************************
 ****************Задача 1*******************
 ******************************************/
console.log('Задача 1');

let algebra;
let geography;
let physics;

algebra = 5;
geography = 4;
physics = 4;

let averageScore = (algebra + geography + physics) / 3;

console.log('Средний балл: ' + averageScore);

// let score = [algebra, geography, physics];

// let scoreSum = 0;

// for (i = 0; i < score.length; i++) {
//     scoreSum = scoreSum + score[i];
//     console.log(scoreSum);
// }

// let averageScore = scoreSum / score.length;
// console.log('Средний балл: ' + averageScore);

/*******************************************
 *******************************************
 ******************************************/



/*******************************************
 ****************Задача 2*******************
 ******************************************/

console.log('Задача 2');

let myName = 'Роман';

message = `Привет, мир! Меня зовут ${myName}.`;

console.log(message);


/*******************************************
 *******************************************
 ******************************************/




/*******************************************
 ****************Задача 3*******************
 ******************************************/

console.log('Задача 2');

 let x;
 let y;
 let z;

x= 2;
y = 22;
z = 0;

let result;

result = x * y + 5 * z + x - 1;

console.log('Результат ' + result);


/*******************************************
 *******************************************
 ******************************************/
